using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
/*1.	Составить программу вывода на экран в одну строку трех любых чисел с двумя пробелами между ними.*/
namespace ConsoleApp1
{
    class Program
    {
        static void Main(string[] args)
        {
           
            int a = 5;
            int b = 10;
            int c = 15;
            Console.WriteLine(a ); 
        }
    }
}
